org/main/20210930095539-terraria.org
:PROPERTIES:
:ID:       EE1F0788-6742-46AC-A668-47F7D1B620DB
:END:
#+title: Terraria Goingthrough
#+HUGO_SECTION:main
* 后肉山计划 
  ref：[[https:https://terraria.fandom.com/zh/wiki/%E6%8C%87%E5%8D%97:%E9%80%9A%E5%85%B3%E6%94%BB%E7%95%A5/Hardmode#.E7.B2.89.E7.A2.8E.E7.A5.AD.E5.9D.9B][TerraWiki困难模式指南]]
** DONE 1.准备阶段
   CLOSED: [2021-10-06 Wed 22:48]
   :LOGBOOK:
   - State "DONE"       from "NEXT"       [2021-10-06 Wed 22:48]
   :END:
*** DONE 1.基于矿石：钯金，秘银，钛金，山铜
    CLOSED: [2021-10-06 Wed 22:48]
    :LOGBOOK:
    - State "DONE"       from "NEXT"       [2021-10-06 Wed 22:48]
    :END:
    标题顺序为强度顺序
*** DONE 2.魔法装备
    CLOSED: [2021-10-06 Wed 22:48]
    :LOGBOOK:
    - State "DONE"       from "NEXT"       [2021-10-06 Wed 22:48]
    :END:
**** 以装备为目标
     + [X] 诅咒焰
       弹射，高伤害，燃烧，连发,重力
     + [ ] 黄金雨
       去树妖那里买猩红种子，做猩红之地，在猩红之地刷灵液做
     + [ ]神灯烈焰
       + 沙漠幽魂灯
	 沙漠幽魂
       + 禁戒碎片
	 沙尘精
       + 暗影之魂
     + [ ] 裂天剑
       在拜月教邪教徒前都很强
       
       + 魔法导弹
       + 光明碎块2
       + 光明之魂15	 
     + [ ] 魔力花
       在丛林找大自然的恩赐
     + [ ] 雨云魔杖
       来自愤怒雨云
       持续伤害
     + [ ] 水晶蛇
       在神圣之地钓鱼
       直线攻击，分裂
     + [ ] 彩虹魔杖
       合成:
     + [ ] 剧毒法杖
       来自黑隐士
     + [ ] 冰霜法杖
       来自冰雪地带，冰雪人鱼和冰雪精
**** 以敌怪为目标
     + 宝箱怪
       宝箱怪掉落很多钱和珍贵道具
       在地狱有很多，在冰雪，地下腐化和神圣之地能找到特殊。
*** TODO 3.近战装备
**** yoyo
     + amarok
     + hel-fire
*** TODO 4.远程装备
**** 箭
***** 圣箭
      落星星
      + 妖精尘
      + 独角兽角
**** 枪械
***** Uzi
      Highest priority
      打丛林的食人花，1%
***** 爆破子弹
      打毁灭者很有用的子弹
      强击退
      可以配合霰弹枪
      + 空心子弹--军火商
      + 爆破粉--炸弹商
***** 水晶子弹
      打得很快，爆炸，碎片
      巨兽鲨+水晶子弹可以在几秒内干掉wall of flesh
      + 火枪子弹
      + 水晶碎块
	地下神圣之地
***** 高速子弹
      很快，不太用预测
      可以打两次
      + 子弹
      + 齿轮
	蒸汽朋克人

** DONE 2.新三王
   CLOSED: [2021-10-04 Mon 11:47]
   打完一个新三王后就可以打撒旦军队了
   
*** 新的装备

**** 魔法
     + [ ] 彩虹魔杖
       + 水晶碎块10
       + 独角兽角2
       + 妖精尘10
       + 光明之魂8
       + 视域之魂15 （双子魔眼）
     + [ ]无限智慧巨著
       来自打败一个机械Boss后的撒旦军队食人魔Boss
       笑杀毁灭者
** TODO 3.新丛林&地狱
** TODO 4.世纪之花
   :LOGBOOK:
   CLOCK: [2021-10-07 Thu 16:45]--[2021-10-07 Thu 21:06] =>  4:21
   :END:
** TODO 5.神庙
** TODO 6.石巨人
** TODO 7.地牢
   + [ ] 磁球
** TODO 8.猪龙鱼公爵
   + [ ] 利刃台风
** TODO 9.拜月教邪教徒
** TODO 10.天界柱
** TODO 11.月亮领主
** TODO 12.
* Terraria 网络服务器
  使用我的GigsGigsCloud服务器host一个Terraria的网络服务器
* 灾厄
** 史莱姆之神
** 肉山
** 打祭坛
** 地牢
*** 炼药桌
** 极地之灵
** 毁灭者
** 双子眼

